### Datos del Titanic

In [7]:
import seaborn as sns

In [8]:
titanic = sns.load_dataset("titanic")

In [9]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
titanic.shape

(891, 15)

In [11]:
import numpy as np
import pandas as pd

In [12]:
titanic["survived"] = pd.Categorical(titanic["survived"])
titanic["pclass"] = pd.Categorical(titanic["pclass"])
titanic["sex"] = pd.Categorical(titanic["sex"])
titanic["deck"] = pd.Categorical(titanic["deck"])

# Tablas de contingencia de una variable

In [14]:
tab = pd.crosstab(index=titanic["survived"], columns="pasajeros")
tab

col_0     pasajeros
survived
0               549
1               342

In [15]:
type(tab)

pandas.core.frame.DataFrame

In [16]:
tab_class = pd.crosstab(index=titanic["pclass"], columns="pasajeros")
tab_class

col_0   pasajeros
pclass
1             216
2             184
3             491

In [17]:
tab_sex = pd.crosstab(index=titanic["sex"], columns="pasajeros")
tab_sex

col_0   pasajeros
sex
female        314
male          577

In [18]:
tab_c = pd.crosstab(index=titanic["deck"], columns="count")
tab_c

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [19]:
tab_c.sum()

col_0
count    203
dtype: int64

In [20]:
tab_c.shape

(7, 1)

In [21]:
tab_c.iloc[1:5]

col_0  count
deck
B         47
C         59
D         33
E         32

In [22]:
tab_c/tab_c.sum()

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

In [23]:
tab_sex/tab_sex.sum()

col_0   pasajeros
sex
female   0.352413
male     0.647587

In [24]:
tab_class/tab_class.sum()

col_0   pasajeros
pclass
1        0.242424
2        0.206510
3        0.551066

### Tabla de contingencia de dos variables

In [26]:
survived_sex = pd.crosstab(index = titanic["survived"],
                          columns = titanic["sex"])
survived_sex.index = ["died", "survived"]
survived_sex.columns = ["femenino", "masculino"]
survived_sex

          femenino  masculino
died            81        468
survived       233        109

In [27]:
survived_class = pd.crosstab(index = titanic["survived"],
                            columns = titanic["pclass"],
                            margins = True)
survived_class.index = ["murio", "sobrevivio", "total_clase"]
survived_class.columns = ["primera", "segunda", "tercera", "total_superv"]
survived_class

             primera  segunda  tercera  total_superv
murio             80       97      372           549
sobrevivio       136       87      119           342
total_clase      216      184      491           891

### Frecuencias relativas globales de dos variables

In [29]:
survived_class/survived_class.loc["total_clase", "total_superv"]

              primera   segunda   tercera  total_superv
murio        0.089787  0.108866  0.417508      0.616162
sobrevivio   0.152637  0.097643  0.133558      0.383838
total_clase  0.242424  0.206510  0.551066      1.000000

### Frecuenciass relativas marginales de dos variables

Respecto a la columna

In [32]:
survived_class/survived_class.loc["total_clase"]

             primera   segunda   tercera  total_superv
murio        0.37037  0.527174  0.757637      0.616162
sobrevivio   0.62963  0.472826  0.242363      0.383838
total_clase  1.00000  1.000000  1.000000      1.000000

In [33]:
survived_class.div(survived_class.loc["total_clase"], axis=1)

             primera   segunda   tercera  total_superv
murio        0.37037  0.527174  0.757637      0.616162
sobrevivio   0.62963  0.472826  0.242363      0.383838
total_clase  1.00000  1.000000  1.000000      1.000000

Respecto a la fila

In [35]:
survived_class.T/survived_class["total_superv"]

                 murio  sobrevivio  total_clase
primera       0.145719    0.397661     0.242424
segunda       0.176685    0.254386     0.206510
tercera       0.677596    0.347953     0.551066
total_superv  1.000000    1.000000     1.000000

In [36]:
survived_class.div(survived_class["total_superv"], axis=0)

              primera   segunda   tercera  total_superv
murio        0.145719  0.176685  0.677596           1.0
sobrevivio   0.397661  0.254386  0.347953           1.0
total_clase  0.242424  0.206510  0.551066           1.0

### Tabla multi dimensionales

In [38]:
surv_sex_class["female"]

NameError: name 'surv_sex_class' is not defined

In [ ]:
surv_sex_class["female"][1]

In [ ]:
surv_sex_class = pd.crosstab(index = titanic["survived"],
                            columns = [titanic["sex"], titanic["pclass"]],
                            margins = True)
surv_sex_class

In [ ]:
surv_sex_class/surv_sex_class.loc["All", "All"]

In [ ]:
total = surv_sex_class.loc["All","All"]
print(total)
type(total)
surv_sex_class/total

In [ ]:
surv_sex_class/surv_sex_class.loc["All"] # Frecuencia Respecto a survived (fila)

In [ ]:
surv_sex_class/surv_sex_class.loc["All"] # Frecuencia Respecto a survived (fila)

## Tarea 11

In [96]:
# Vector de nombres de alumnos alargado a 50 elementos
alumnos = [
    "Carlos", "María", "Luis", "Ana", "José", "Elena", "Miguel", "Laura", "Andrés", "Lucía",
    "Juan", "Sofía", "Raúl", "Valeria", "Ricardo", "Isabel", "Pedro", "Carmen", "Javier", "Rosa",
    "Carlos", "María", "Luis", "Ana", "José", "Elena", "Miguel", "Laura", "Andrés", "Lucía",
    "Juan", "Sofía", "Raúl", "Valeria", "Ricardo", "Isabel", "Pedro", "Carmen", "Javier", "Rosa",
    "Carlos", "María", "Luis", "Ana", "José", "Elena", "Miguel", "Laura", "Andrés", "Lucía"
]

# Vector de edades (en años) alargado a 50 elementos
edades = [
    20, 21, 22, 23, 21, 20, 22, 24, 23, 21,
    20, 23, 21, 22, 20, 21, 22, 23, 21, 22,
    20, 21, 22, 23, 21, 20, 22, 24, 23, 21,
    20, 23, 21, 22, 20, 21, 22, 23, 21, 22,
    20, 21, 22, 23, 21, 20, 22, 24, 23, 21
]

# Vector de alturas alargado a 50 elementos
alturas = [
    "chico", "mediano", "alto", "chico", "mediano", "alto", "chico", "mediano", "alto", "chico",
    "mediano", "alto", "chico", "mediano", "alto", "chico", "mediano", "alto", "chico", "mediano",
    "chico", "mediano", "alto", "chico", "mediano", "alto", "chico", "mediano", "alto", "chico",
    "mediano", "alto", "chico", "mediano", "alto", "chico", "mediano", "alto", "chico", "mediano",
    "chico", "mediano", "alto", "chico", "mediano", "alto", "chico", "mediano", "alto", "chico"
]

# Vector de pesos alargado a 50 elementos
pesos = [
    "flaco", "normal", "gordo", "flaco", "normal", "gordo", "flaco", "normal", "gordo", "flaco",
    "normal", "gordo", "flaco", "normal", "gordo", "flaco", "normal", "gordo", "flaco", "normal",
    "flaco", "normal", "gordo", "flaco", "normal", "gordo", "flaco", "normal", "gordo", "flaco",
    "normal", "gordo", "flaco", "normal", "gordo", "flaco", "normal", "gordo", "flaco", "normal",
    "flaco", "normal", "gordo", "flaco", "normal", "gordo", "flaco", "normal", "gordo", "flaco"
]

alumnos = np.array(alumnos)
edades = np.array(edades)
alturas = np.array(alturas)
pesos = np.array(pesos)

In [55]:
type(alumnos)

numpy.ndarray

### Pregunta 1

Da la instrucción que defina la tabla de frecuencias absolutas de un vector llamado alumnos.

In [98]:
p1 = pd.crosstab(index=edades, columns="count")
p1

col_0  count
row_0
20        10
21        15
22        12
23        10
24         3

### Pregunta 2

Con una sola instrucción, define la tabla de frecuencias relativas de un vector llamado edades.

In [100]:
p1/p1.sum()

col_0  count
row_0
20      0.20
21      0.30
22      0.24
23      0.20
24      0.06

### Pregunta 3

Con una sola instrucción, define la tabla bidimensional conjunta de frecuencias absolutas de dos vectores
llamados altura y peso, de forma que las filas correspondan a altura y las columnas a peso.

In [102]:
p3 = pd.crosstab(index = alturas, columns= pesos)
p3

col_0    flaco  gordo  normal
row_0
alto         0     15       0
chico       18      0       0
mediano      0      0      17

### Pregunta 4

Con una sola instrucción, define la tabla bidimensional conjunta de frecuencias relativas calculadas dentro del
total, de dos vectores llamados edad y altura, de forma que las filas correspondan a altura y las columnas
a edad.

In [128]:
p4 = pd.crosstab(index=alturas,
                 columns=edades,
                margins = True)
p4

col_0    20  21  22  23  24  All
row_0
alto      5   0   3   7   0   15
chico     3   9   3   3   0   18
mediano   2   6   6   0   3   17
All      10  15  12  10   3   50

In [132]:
f4 = p4/p4.loc["All", "All"]
f4

col_0      20    21    22    23    24   All
row_0
alto     0.10  0.00  0.06  0.14  0.00  0.30
chico    0.06  0.18  0.06  0.06  0.00  0.36
mediano  0.04  0.12  0.12  0.00  0.06  0.34
All      0.20  0.30  0.24  0.20  0.06  1.00

### Pregunta 5

Con una sola instrucción, dibuja un diagrama de barras básico de un vector llamado edad.